---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileReadOptions.Dispose
source: html/231b303a-42a8-0752-f2df-4c369d383541.htm
---
# Autodesk.Revit.DB.IFC.IFCFileReadOptions.Dispose Method

Releases all resources used by the IFCFileReadOptions

## Syntax (C#)
```csharp
public void Dispose()
```